max-bot-cf/AccumulationRegisters/бестВзаиморасчётыПоСФЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчётыПоСФЮрЛица</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/AccumulationRegisters/бестЗарегистрированныеОбъемыПотребленияНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестЗарегистрированныеОбъемыПотребленияНП</Name>
			<Comment>Зарегистрированные объемы потребления НП</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемПоПрибору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДосчитанный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемИтоговый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовШтатнойРаботыПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовРаботыТУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/AccumulationRegisters/БестОплатаУслугЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БестОплатаУслугЮрЛица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/AccumulationRegisters/бестАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестАвансы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/CommonModules/бестДатыЗапретаИзмененияПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - (начальное значение Ложь),
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// Параметры:
//  Разделы - ТаблицаЗначений - с колонками:
//   * Имя - Строка - имя используемое в описании источников данных в
//       процедуре ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
//
//   * Идентификатор - УникальныйИдентификатор - идентификатор ссылки элемента плана видов характеристик.
//       Чтобы получить идентификатор нужно в режиме 1С:Предприятия выполнить метод платформы:
//       "ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку().УникальныйИдентификатор()".
//       Не следует указывать идентификаторы, полученные любым другим способом,
//       так как это может нарушить их уникальность.
//
//   * Представление - Строка - представляет раздел в форме настройки дат запрета.
//
//   * ТипыОбъектов  - Массив - типы ссылок объектов в разрезе которых можно настроить даты запрета,
//       например, Тип("СправочникСсылка.Организации"), если не указано ни одного типа,
//       то даты запрета будут настраиваться только с точностью до раздела.
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	
КонецПроцедуры

// Позволяет задать таблицы и поля объектов для проверки запрета изменения данных.
// Для добавления нового источника в ИсточникиДанных см. ДатыЗапретаИзменения.ДобавитьСтроку.
//
// Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
// используемой в подписке на событие ПередЗаписью объекта для проверки наличия
// запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя раздела дат запрета, указанного в
//                   процедуре ПриЗаполненииРазделовДатЗапретаИзменения (см. выше).
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация", "Товары.Склад".
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	// Документы	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестАктПринятияПрибораУчетаККоммерческомуУчету", 				"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестВводНачальныхОстатковЮридическихЛиц", 						"Дата" ,	"Район", 	"Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЕдиныйПлатежныйДокумент", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЗаключениеДоговоровСЮридическимиЛицами", 					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЗаявлениеНаЗаключениеДоговора", 								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеИндивидуальныхНастроекСезонности", 					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеСобственникаОбъектаРасчета", 						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеСудсидииЖильцам", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеТемпературногоГрафикаОбъектов", 					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзмененияОкружающейСреды", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьФормуУправленияМКД", 								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеНП", 												"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеПоДолевымСхемам", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестОбращения", 													"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестОперацияСОбъектамиНП", 										"Дата" , 	"Район",	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестОперацияСПриборомУчетаНП", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестОперацияСУслугамиНП", 										"Дата" ,	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПерерасчетНП", 												"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПлатежноеПоручениеВходящееЮрЛица", 							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияНачисленияПИД", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияОбъемовПотребленияПриборовУчета", 				"Дата" , 	"Район",	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияОбъемовПУМКД", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияПоказанийНП", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияПоказанийНПОбщий", 								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестСменаРабочегоПостановленияМКД", 								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестСуточнаяВедомость", 											"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьГарантированныеОбъемыНП",							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьГруппуПотребителейНП", 							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьЗначениеПлощадиНП", 								"Дата" , 	"Район",	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьНагрузкуПоУслугам", 								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьПоказателиТемпературыВнутриПомещения", 			"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьПотребителейГВС", 									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьСпособНачисленияПоНормативуНП", 					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьСреднемесячнуюТемпературу", 						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьТемпературуНаружногоВоздуха", 						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьТемпературыИсточника", 							"Дата" ,	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД", 		"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьФормулуРасчетаТочекУчетаНП", 						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеТиповСхемГВСМКД", 									"Дата" , 	"Район", 	"Район");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестСменаПоставщикаНП", 											"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьДатуПоверкиПУ",						 			"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРеализацияЮрЛица",										 	"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеПениНП",										 	"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьФормулуРасчетаСтруктурыСети",						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеПоСхемамСтруктурыСети",							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестДополнительныеНачисления",									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьДанныеДляДополнительногоРасчета",					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьДоговорПоУслуге",									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьТочкиПоставкиНаОбъектРасчета",						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПочасоваяВедомость",											"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЗагруженныеДанныеИзВнешнихИсточников",						"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьНомерПломбыПрибораУчета",							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьПараметрыТочкиУчета",								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьЗначениеСбытовойНадбавки",							"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьТарифНаПередачуЭлектроэнергии",						"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьЗначениеПлатыЗаИныеУслуги",							"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияБездоговорногоБезучетногоПотребления",			"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеЭлектроэнергии",									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены",			"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьЧасыПиковойНагрузки",								"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьПлановыеЧасыПиковойНагрузки",						"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПрофильГарантирующегоПоставщика",							"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеПоДолевымСхемамЭлектроэнергии",					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьКоличествоНедопусковЮЛ",							"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестАктированиеНедопускаДопускаЮЛ",								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзмененитьРазрядностьОбъемовУслуг",							"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПлатежныйДокумент",											"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица",							"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестКорректировкаЗадолженности",									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестПерерасчетЭЭ",												"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЗаписиКнигПродажПокупок",									"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьНастройкиРасчетаПениЮЛ",								"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестСписаниеВосстановлениеЗадолженности",						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРегистрацияБанкротства",										"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестРеструктуризацияЗадолженности",								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеЗависимостиУзловИПриборовУчета",					"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестУстановитьСхемуДораспределениеОбъемаУК",						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменитьРасчетТУПоГрафикуГП",								"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестОстановкаРасчетаПени", 									    "Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестКорректировкаПениПоСудебномуРешению", 						"Дата" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестСчетФактураНаАванс",					 						"Дата" , 	"Район", 	"Район");
    ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестЗапретРедактированияДоговораКонтрагента",					"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзменениеТарифнойСетки",						                "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНачислениеОбъемовУК",					 					"Дата" , 	"Район", 	"Район");
	
	// Регистры накопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестОбъемНачисленийНП", 								"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестНачисленныйСреднийОбъемНП", 						"Период" ,	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестВзаиморасчётыПоСФЮрЛица", 							"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестВзаиморасчётыПоУслугамЮрЛица", 						"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестЗарегистрированныеОбъемыПотребленияНП", 			"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БестОплатаУслугЮрЛица", 								"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестВзаиморасчетыПоПени", 								"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестОбъемНачисленийЭлектроэнергии", 					"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестАвансы", 											"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестАвансыИспользованные", 								"Период" , 	"Район", 	"Район");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестАвансыПоступившие", 								"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестОбъемыПени", 										"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестОплатаУслуг", 										"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестАвансыЭЭ", 											"Период" , 	"Район", 	"Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.бестАвансыИспользованныеЭЭ", 							"Период" , 	"Район", 	"Район");
КонецПроцедуры

// Позволяет переопределить выполнение проверки запрета изменения произвольным образом.
//
// Если проверка выполняется в процессе записи документа, то в свойстве ДополнительныеСвойства документа Объект
// имеется свойство РежимЗаписи.
//  
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект, 
//                 РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - проверяемый элемент данных или набор записей 
//                 (который передается из обработчиков ПередЗаписью и ПриЧтенииНаСервере).
//
//  ПроверкаЗапретаИзменения    - Булево - установить в Ложь, чтобы пропустить проверку запрета изменения данных.
//  УзелПроверкиЗапретаЗагрузки - ПланыОбменаСсылка, Неопределено - установить в Неопределено, чтобы 
//                                пропустить проверку запрета загрузки данных.
//  ВерсияОбъекта               - Строка - установить "СтараяВерсия" или "НоваяВерсия", чтобы
//                                выполнить проверку только старой (в базе данных) 
//                                или только новой версии объекта (в параметре Объект).
//                                По умолчанию содержит значение "" - проверяются обе версии объекта сразу.
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
